In [2]:
import pandas as pd
import numpy as np

In [3]:
index = pd.date_range('1/1/2000', periods=8)
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

df = pd.DataFrame(np.random.randn(8, 3), index=index,columns=['A', 'B', 'C'])

In [4]:
long_series = pd.Series(np.random.randn(1000))

In [5]:
long_series.head(10)

0    1.376259
1    1.046928
2   -0.039207
3   -0.481390
4   -1.001426
5   -1.521878
6    1.824179
7   -0.711155
8    0.221546
9    0.164477
dtype: float64

In [6]:
long_series.tail(3)

997   -1.273068
998    0.474311
999   -0.150014
dtype: float64

In [7]:
df[:2]

                   A         B         C
2000-01-01  0.161576 -1.202039 -0.382199
2000-01-02 -1.208151 -0.166575 -0.294894

In [10]:
df.columns=[x.lower() for x in df.columns]

In [11]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [12]:
df.values #to create an aaaray

array([[ 0.16157632, -1.20203861, -0.38219886],
       [-1.20815147, -0.16657515, -0.29489393],
       [-0.8584408 , -0.02231506,  0.37095344],
       [ 0.65679769,  0.26753185, -0.55735184],
       [-0.58735419,  0.68256601,  0.11426769],
       [-1.57887224,  0.67971617, -0.06914633],
       [-0.5761669 ,  1.08240192, -0.94761228],
       [-2.55248747,  0.04450767, -0.02917013]])

In [15]:
df4 = pd.DataFrame(np.random.randint(1,50,[5,5]),index=list('ABCDE'))

In [16]:
dfnew = df4+df

In [17]:
dfnew

                      0   1   2   3   4   a   b   c
2000-01-01 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-02 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-03 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-04 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-05 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-06 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-07 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
2000-01-08 00:00:00 NaN NaN NaN NaN NaN NaN NaN NaN
A                   NaN NaN NaN NaN NaN NaN NaN NaN
B                   NaN NaN NaN NaN NaN NaN NaN NaN
C                   NaN NaN NaN NaN NaN NaN NaN NaN
D                   NaN NaN NaN NaN NaN NaN NaN NaN
E                   NaN NaN NaN NaN NaN NaN NaN NaN

In [18]:
df.add(df4,fill_value=0)

,a,b,c,0,1,2,3,4
2000-01-01 00:00:00,0.161576,-1.202039,-0.382199,NaN,NaN,NaN,NaN,NaN
2000-01-02 00:00:00,-1.208151,-0.166575,-0.294894,NaN,NaN,NaN,NaN,NaN
2000-01-03 00:00:00,-0.858441,-0.022315,0.370953,NaN,NaN,NaN,NaN,NaN
2000-01-04 00:00:00,0.656798,0.267532,-0.557352,NaN,NaN,NaN,NaN,NaN
2000-01-05 00:00:00,-0.587354,0.682566,0.114268,NaN,NaN,NaN,NaN,NaN
2000-01-06 00:00:00,-1.578872,0.679716,-0.069146,NaN,NaN,NaN,NaN,NaN
2000-01-07 00:00:00,-0.576167,1.082402,-0.947612,NaN,NaN,NaN,NaN,NaN
2000-01-08 00:00:00,-2.552487,0.044508,-0.029170,NaN,NaN,NaN,NaN,NaN
A,NaN,NaN,NaN,25.0,43.0,33.0,42.0,1.0
B,NaN,NaN,NaN,6.0,11.0,12.0,25.0,8.0
C,NaN,NaN,NaN,16.0,7.0,8.0,3.0,33.0
D,NaN,NaN,NaN,19.0,11.0,45.0,10.0,2.0
E,NaN,NaN,NaN,9.0,44.0,11.0,9.0,28.0

### Flexible Comparision

Series and DataFrame have the binary comparison methods **eq, ne, lt, gt, le, and ge** whose behavior is analogous to the binary arithmetic operations described above:

In [19]:
df.eq(df4)

                         a      b      c      0      1      2      3      4
2000-01-01 00:00:00  False  False  False  False  False  False  False  False
2000-01-02 00:00:00  False  False  False  False  False  False  False  False
2000-01-03 00:00:00  False  False  False  False  False  False  False  False
2000-01-04 00:00:00  False  False  False  False  False  False  False  False
2000-01-05 00:00:00  False  False  False  False  False  False  False  False
2000-01-06 00:00:00  False  False  False  False  False  False  False  False
2000-01-07 00:00:00  False  False  False  False  False  False  False  False
2000-01-08 00:00:00  False  False  False  False  False  False  False  False
A                    False  False  False  False  False  False  False  False
B                    False  False  False  False  False  False  False  False
C                    False  False  False  False  False  False  False  False
D                    False  False  False  False  False  False  False  False
E                    False  False  False  False  False  False  False  False

In [20]:
df.ne(df4)

                        a     b     c     0     1     2     3     4
2000-01-01 00:00:00  True  True  True  True  True  True  True  True
2000-01-02 00:00:00  True  True  True  True  True  True  True  True
2000-01-03 00:00:00  True  True  True  True  True  True  True  True
2000-01-04 00:00:00  True  True  True  True  True  True  True  True
2000-01-05 00:00:00  True  True  True  True  True  True  True  True
2000-01-06 00:00:00  True  True  True  True  True  True  True  True
2000-01-07 00:00:00  True  True  True  True  True  True  True  True
2000-01-08 00:00:00  True  True  True  True  True  True  True  True
A                    True  True  True  True  True  True  True  True
B                    True  True  True  True  True  True  True  True
C                    True  True  True  True  True  True  True  True
D                    True  True  True  True  True  True  True  True
E                    True  True  True  True  True  True  True  True

In [21]:
#ne stands for not equal

**Boolean Reductions**

In [22]:
(df>0).all()

a    False
b    False
c    False
dtype: bool

In [25]:
(df>0).any()

a    True
b    True
c    True
dtype: bool

In [26]:
df.empty

False

In [27]:
pd.DataFrame(columns=list('ABC')).empty

True

### Descriptive Stastics

In [32]:
df.mean(1)

2000-01-01   -0.474220
2000-01-02   -0.556540
2000-01-03   -0.169934
2000-01-04    0.122326
2000-01-05    0.069827
2000-01-06   -0.322767
2000-01-07   -0.147126
2000-01-08   -0.845717
Freq: D, dtype: float64

In [33]:
df.sum(skipna=False)

a   -6.543099
b    1.365795
c   -1.795152
dtype: float64

In [35]:
df.sum(skipna=False,axis=1)

2000-01-01   -1.422661
2000-01-02   -1.669621
2000-01-03   -0.509802
2000-01-04    0.366978
2000-01-05    0.209480
2000-01-06   -0.968302
2000-01-07   -0.441377
2000-01-08   -2.537150
Freq: D, dtype: float64

In [36]:
df.std()

a    0.999107
b    0.698266
c    0.413197
dtype: float64

In [37]:
df.cumsum()

                   a         b         c
2000-01-01  0.161576 -1.202039 -0.382199
2000-01-02 -1.046575 -1.368614 -0.677093
2000-01-03 -1.905016 -1.390929 -0.306139
2000-01-04 -1.248218 -1.123397 -0.863491
2000-01-05 -1.835572 -0.440831 -0.749223
2000-01-06 -3.414445  0.238885 -0.818370
2000-01-07 -3.990612  1.321287 -1.765982
2000-01-08 -6.543099  1.365795 -1.795152

In [38]:
df.count()

a    8
b    8
c    8
dtype: int64

In [40]:
df.mad()  #mean absolute deviation

a    0.731601
b    0.507330
c    0.321120
dtype: float64

- Mean,max,mode,mad,std,abs,mode,prod,var(unbiased),sem(standard error of mean),skew,kurt,quntile,cumsum.cumprod,cummax,cummin.

In [41]:
df.describe()

              a         b         c
count  8.000000  8.000000  8.000000
mean  -0.817887  0.170724 -0.224394
std    0.999107  0.698266  0.413197
min   -2.552487 -1.202039 -0.947612
25%   -1.300832 -0.058380 -0.425987
50%   -0.722897  0.156020 -0.182020
75%   -0.391731  0.680429  0.006689
max    0.656798  1.082402  0.370953

- Index of Min/Max Values

In [42]:
df.idxmax()

a   2000-01-04
b   2000-01-07
c   2000-01-03
dtype: datetime64[ns]

In [43]:
df.idxmin()

a   2000-01-08
b   2000-01-01
c   2000-01-07
dtype: datetime64[ns]

In [44]:
data = np.random.randint(0, 7, size=50)

In [46]:
ser = pd.Series(data)
ser.value_counts()

6    11
4    10
1     9
2     7
5     5
3     4
0     4
dtype: int64

In [47]:
ser.mode()

0    6
dtype: int32

**Apply Function**

In [48]:
df.apply(np.mean)

a   -0.817887
b    0.170724
c   -0.224394
dtype: float64

In [49]:
df.apply(np.mean,axis=1)

2000-01-01   -0.474220
2000-01-02   -0.556540
2000-01-03   -0.169934
2000-01-04    0.122326
2000-01-05    0.069827
2000-01-06   -0.322767
2000-01-07   -0.147126
2000-01-08   -0.845717
Freq: D, dtype: float64

In [50]:
df.apply(lambda x: x.max() - x.min())

a    3.209285
b    2.284441
c    1.318566
dtype: float64

In [52]:
df.apply(np.cumsum)

                   a         b         c
2000-01-01  0.161576 -1.202039 -0.382199
2000-01-02 -1.046575 -1.368614 -0.677093
2000-01-03 -1.905016 -1.390929 -0.306139
2000-01-04 -1.248218 -1.123397 -0.863491
2000-01-05 -1.835572 -0.440831 -0.749223
2000-01-06 -3.414445  0.238885 -0.818370
2000-01-07 -3.990612  1.321287 -1.765982
2000-01-08 -6.543099  1.365795 -1.795152

In [54]:
df.apply(np.exp)

                   a         b         c
2000-01-01  1.175362  0.300581  0.682359
2000-01-02  0.298749  0.846559  0.744611
2000-01-03  0.423822  0.977932  1.449116
2000-01-04  1.928606  1.306735  0.572724
2000-01-05  0.555796  1.978949  1.121052
2000-01-06  0.206208  1.973318  0.933190
2000-01-07  0.562049  2.951761  0.387666
2000-01-08  0.077888  1.045513  0.971251

In [55]:
df.apply(len)

a    8
b    8
c    8
dtype: int64

In [56]:
df.apply('mean')

a   -0.817887
b    0.170724
c   -0.224394
dtype: float64

In [57]:
df.apply('mean',axis=1)

2000-01-01   -0.474220
2000-01-02   -0.556540
2000-01-03   -0.169934
2000-01-04    0.122326
2000-01-05    0.069827
2000-01-06   -0.322767
2000-01-07   -0.147126
2000-01-08   -0.845717
Freq: D, dtype: float64

In [58]:
tsdf = pd.DataFrame(np.random.randn(1000, 3), columns=['A', 'B', 'C'],index=pd.date_range('1/1/2000', periods=1000))

In [60]:
tsdf.apply(lambda x:x.idxmax())

A   2001-10-16
B   2000-03-23
C   2002-04-17
dtype: datetime64[ns]

In [61]:
tsdf.agg(np.sum)

A    -3.345645
B   -40.176789
C   -12.809785
dtype: float64

In [62]:
tsdf.agg('sum')

A    -3.345645
B   -40.176789
C   -12.809785
dtype: float64

In [63]:
tsdf.sum()

A    -3.345645
B   -40.176789
C   -12.809785
dtype: float64

In [64]:
tsdf['A'].sum()

-3.345644544146807

- Aggregating with multiple functions

In [65]:
tsdf.agg(['sum'])

            A          B          C
sum -3.345645 -40.176789 -12.809785

In [66]:
tsdf.agg(['sum','mean'])

             A          B          C
sum  -3.345645 -40.176789 -12.809785
mean -0.003346  -0.040177  -0.012810

In [67]:
tsdf.A.agg(['sum', 'mean'])

sum    -3.345645
mean   -0.003346
Name: A, dtype: float64

In [68]:
tsdf.A.agg(['sum', lambda x: x.mean()])

sum        -3.345645
<lambda>   -0.003346
Name: A, dtype: float64

In [69]:
def mymean(x):
    return x.mean()

In [70]:
tsdf.A.agg(['sum', mymean])

sum      -3.345645
mymean   -0.003346
Name: A, dtype: float64

In [74]:
tsdf.agg({'A':'mean','B':'mean'})

A   -0.003346
B   -0.040177
dtype: float64

In [75]:
tsdf.agg({'A':['mean','min'],'B':'mean'})

             A         B
mean -0.003346 -0.040177
min  -2.879745       NaN

In [76]:
df.transform(np.abs)

                   a         b         c
2000-01-01  0.161576  1.202039  0.382199
2000-01-02  1.208151  0.166575  0.294894
2000-01-03  0.858441  0.022315  0.370953
2000-01-04  0.656798  0.267532  0.557352
2000-01-05  0.587354  0.682566  0.114268
2000-01-06  1.578872  0.679716  0.069146
2000-01-07  0.576167  1.082402  0.947612
2000-01-08  2.552487  0.044508  0.029170

In [77]:
df.transform('abs')

                   a         b         c
2000-01-01  0.161576  1.202039  0.382199
2000-01-02  1.208151  0.166575  0.294894
2000-01-03  0.858441  0.022315  0.370953
2000-01-04  0.656798  0.267532  0.557352
2000-01-05  0.587354  0.682566  0.114268
2000-01-06  1.578872  0.679716  0.069146
2000-01-07  0.576167  1.082402  0.947612
2000-01-08  2.552487  0.044508  0.029170

In [78]:
df.transform(lambda x:abs(x))

                   a         b         c
2000-01-01  0.161576  1.202039  0.382199
2000-01-02  1.208151  0.166575  0.294894
2000-01-03  0.858441  0.022315  0.370953
2000-01-04  0.656798  0.267532  0.557352
2000-01-05  0.587354  0.682566  0.114268
2000-01-06  1.578872  0.679716  0.069146
2000-01-07  0.576167  1.082402  0.947612
2000-01-08  2.552487  0.044508  0.029170

In [80]:
df.transform([np.abs,lambda x:x+1])

                   a                   b                   c
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2000-01-01  0.161576  1.161576  1.202039 -0.202039  0.382199  0.617801
2000-01-02  1.208151 -0.208151  0.166575  0.833425  0.294894  0.705106
2000-01-03  0.858441  0.141559  0.022315  0.977685  0.370953  1.370953
2000-01-04  0.656798  1.656798  0.267532  1.267532  0.557352  0.442648
2000-01-05  0.587354  0.412646  0.682566  1.682566  0.114268  1.114268
2000-01-06  1.578872 -0.578872  0.679716  1.679716  0.069146  0.930854
2000-01-07  0.576167  0.423833  1.082402  2.082402  0.947612  0.052388
2000-01-08  2.552487 -1.552487  0.044508  1.044508  0.029170  0.970830

### Applying Elementwise Functions
- Since not all functions can be vectorized (accept NumPy arrays and return another array or value), the methods applymap() on DataFrame and analogously map() on Series accept any Python function taking a single value and returning a single value. For example:

In [82]:
f = lambda x:len(str(x))

In [85]:
df4[0].map(f)

A    2
B    1
C    2
D    2
E    1
Name: 0, dtype: int64

In [86]:
df.applymap(f)

             a   b   c
2000-01-01  19  19  20
2000-01-02  19  20  19
2000-01-03  19  20  19
2000-01-04  18  18  19
2000-01-05  19  17  19
2000-01-06  19  18  19
2000-01-07  19  18  19
2000-01-08  18  19  21

In [87]:
s = pd.Series(['six', 'seven', 'six', 'seven', 'six'],index=['a', 'b', 'c', 'd', 'e'])

In [88]:
t = pd.Series({'six' : 6., 'seven' : 7.})

In [89]:
s

a      six
b    seven
c      six
d    seven
e      six
dtype: object

In [90]:
s.map(t)

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

### Aligning objects with each other with align.

In [93]:
s1 = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [94]:
s1.align(s)

(a    1.492243
 b    0.313510
 c   -0.867149
 d   -0.003590
 e   -1.436546
 dtype: float64, a    0.518754
 b   -0.116691
 c    1.194901
 d   -0.624791
 e    0.431212
 dtype: float64)

In [96]:
s1.align(s,join='inner')

(a    1.492243
 b    0.313510
 c   -0.867149
 d   -0.003590
 e   -1.436546
 dtype: float64, a    0.518754
 b   -0.116691
 c    1.194901
 d   -0.624791
 e    0.431212
 dtype: float64)

In [97]:
s1.align(s,join='outer')

(a    1.492243
 b    0.313510
 c   -0.867149
 d   -0.003590
 e   -1.436546
 dtype: float64, a    0.518754
 b   -0.116691
 c    1.194901
 d   -0.624791
 e    0.431212
 dtype: float64)

In [98]:
s1.align(s,join='left')

(a    1.492243
 b    0.313510
 c   -0.867149
 d   -0.003590
 e   -1.436546
 dtype: float64, a    0.518754
 b   -0.116691
 c    1.194901
 d   -0.624791
 e    0.431212
 dtype: float64)

In [99]:
s = pd.Series(['a', 'a|b', np.nan, 'a|c'])

In [100]:
s.str.get_dummies(sep='|')

   a  b  c
0  1  0  0
1  1  1  0
2  0  0  0
3  1  0  1